using System;

namespace _06MultiplyTable
{
    class Program
    {
        static void Main(string[] args)
        {
            //Вашата задача е да съставите програма, в която се въвежда цяло
            //трицифрено число и се извежда таблицата за умножение.
            //Поради особености на Вашата програма, тя взима цифрите на
            //въведеното число в обратен ред. Максималната стойност на
            //множителите е определена от всяка една от 3-те цифри на въведеното число.

            //Входът е цяло трицифрено число в интервала[111…999].

            int num = int.Parse(Console.ReadLine()); // d1, d2, d3

            for (int f1 = 1; f1 <= num % 10; f1++)
            {
                for (int f2 = 1; f2 <=  num / 10 % 10; f2++)
                {
                    for (int f3 = 1; f3 <= num / 100; f3++)
                    {
                        Console.WriteLine($"{f1} * {f2} * {f3} = {f1 * f2 * f3};");
                    }
                }
                
            }
           

            //Изход
            //Да се отпечатат на конзолата няколко на брой реда в следния формат:
            //"{първата цифра} * {втората цифра} * {третата цифра} = {резултатът от умножението на трите цифри};"


        }
    }
}
