using System;

namespace _03SumPrimeNonPrime
{
    class Program
    {
        static void Main(string[] args)
        {
            //условие:
            //Напишете програма, която чете от конзолата цели числа в диапазона,
            //докато не се получи команда "stop".Да се намери сумата на всички
            //въведени прости и сумата на всички въведени непрости числа.

            //трябва ни променлива, която да пази нашият вход;
            string input = Console.ReadLine();

            //трябва да имаме променлива, която да пази текущото число;
            int num = 0;

            //промелива на сумата за простите числа
            int sumPrime = 0;
            //промелива на сумаъа за НЕпростите числа
            int sumNonPrime = 0;

            //цикъл до "stop"
            while (input!="stop")
            {
            //всеки път четем число - С ИЗКЛ. на първия път;
                input = Console.ReadLine();
            //преобразуване на вход в число;
                num = int.Parse(input);


                //проверка дали n um е просто или НЕпросто число;
                //=> дали num e - ;
                //=> дали е просто или НЕ просто;




                

      
            }

            //Тъй като по дефиниция от математиката отрицателните числа не
            //могат да бъдат прости, ако на входа се подаде отрицателно число
            //да се изведе следното съобщение "Number is negative.".
            //В този случай въведено число се игнорира и не се прибавя към
            //нито една от двете суми, а програмата продължава своето изпълнение,
            //очаквайки въвеждане на следващо число. 







            //На изхода да се отпечатат на два реда двете намерени суми в
            //следния формат:
            //"Sum of all prime numbers is: {prime numbers sum}"
            //"Sum of all non prime numbers is: {nonprime numbers sum}"


        }
    }
}
