using System;

namespace EX3001
{
    class Program
    {
        static void Main(string[] args)
        {
            //Какво е това цикъл?
            //Винаги когато видим "N" на брой - използваме цикъл!!!


            //i++ - Инкрементация
            //% 10 - връща последната цифра;
            //спестяване на проверки!

            // Int I - типа на индекса; - INT - номер колко пъти се е изпълнил нашият цикъл!
            // Начален, краен индекс и през колко да се променя!

            //Как работи?

            //Предимства?


        }
    }
}
