using System;

namespace _04ComputerFirm
{
    class Program
    {
        static void Main(string[] args)
        {
            //условие:
            //Да се напише програма, която за определен вид компютри пресмята средния рейтинг и направените продажби.
            //Първо се въвежда едно число от конзолата, което представлява броя на моделите компютри.
            //След това последователно за всеки от моделите компютри се въвежда по едно число:


            //    • Последната цифра(единиците) на това число представлява рейтингът, който е в интервала[2…6].
            //    • Останалите цифри(стотици и десетици) са възможните продажби, които ще се осъществят.

            //Компютърната продажба се скалира на база рейтинг:
            //    • Рейтинг 2 взима 0 % от  възможните продажби.
            //    • Рейтинг 3 взима 50 % от възможните продажби.
            //    • Рейтинг 4 взима 70 % от възможните продажби.
            //    • Рейтинг 5 взима 85 % от възможните продажби.
            //    • Рейтинг 6 взима 100 % от възможните продажби.

            //Вход
            //От конзолата се прочита:
            //            На първия ред:
            //    • n - брой компютри - цяло число в интервала[1…10]
            //На следващите n реда:
            //    • Числото, представляващо възможните продажби и рейтинга - цяло число в интервала[32…306]

            int numComputers = int.Parse(Console.ReadLine());
           
            double rating = 0;
            double possibleSales = 0;
            double sales = 0;

            for (int numComp = 1; numComp <= numComputers; numComp++)
            {
                int input = int.Parse(Console.ReadLine());
                string text = input.ToString();

                for (int i = 0; i <= text.Length; i++)
                {
                    rating = i + 2;
                    
                }
            }
          
            //Изход
            //На конзолата се отпечатват 2 редa:
            //    • Броят направени продажби
            //    • Средноаритметичният рейтинг за всички компютри
            //Продажбите и рейтингът трябва да са форматирани до втората цифра след десетичната запетая.
        }
    }
}
